import { miso1, miso2 } from "."

describe('miso', () => {
  it('miso1', () => {
    expect(miso1(2147483647, 2147483647)).toBe(4294967294)
  })

  it('miso2', () => {
    expect(miso2('오백이십삼억삼십이만오','오십')).toBe('오백이십삼억삼십이만오십오')
    expect(miso2('육십사억삼천십팔만칠천육백구','사십삼')).toBe('육십사억삼천십팔만칠천육백오십이')
    expect(miso2('구백육십조칠천억팔천백삼십이만칠천일','사십삼조오천이백억육천구백십만일')).toBe('천사조이천이백일억오천사십이만칠천이')
    expect(miso2('이천구백육십조천오백칠십만삼천구백구십','삼천사백오십조일억이천만육백사십삼')).toBe('육천사백십조일억삼천오백칠십만사천육백삼십삼')
    expect(miso2('사십오억삼천육십만오백구십','칠십억천이백삼십오만칠천구십이')).toBe('백십오억사천이백구십오만칠천육백팔십이')
    expect(miso2('천백십일','구천오백구십구')).toBe('만칠백십')
    expect(miso2('오억사천','백십일')).toBe('오억사천백십일')
    expect(miso2('만오천사백삼십','십구만삼천오백')).toBe('이십만팔천구백삼십')
    expect(miso2('일조','삼')).toBe('일조삼')
    expect(miso2('일억','만')).toBe('일억일만')
  })
})
